# Names, Built-in Functions and Tables #

In this notebook we will learn:
    
- How Python does arithmetic
- How to use variable names
- *Why* we use variable names
- A few of the built-in functions\*
- Some of the basics of tables\** 

\*Over time, we'll learn more as we need them.

\**Tables is a big topic, we'll come back to this repeatedly to cover it completely

In [43]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

## Words of Caution ##
- Remember to run the cell above. It's for setting up the environment so you can have access to what's needed for this lecture. For now, don't worry about what it means: we'll learn more about what's inside of it in the next few lectures.
- Data science is not just about code, so please don't go over this notebook by itself. Have the relevant textbook sections or lecture video at hand so that you can go over the discussion along with the code. Thank you!

## Python ##

In [44]:
2 + 18

20

In [45]:
20 - 2

18

In [46]:
2 * 9

18

In [47]:
9/3

3.0

In [9]:
2 + 3 * 9

29

In [10]:
(2 + 3) * 9

45

In [11]:
# two to the power of four: 2 * 2 * 2 * 2
2 ** 4

16

In [ ]:
"hello"

In [12]:
#Warning: Do not use ^ for exponents.  

2^3

1

## Names ##

In [48]:
a = 4

In [50]:
4 == a

False

In [51]:
a

4

In [52]:
b = 9

In [53]:
b

9

In [54]:
a * 3

12

In [55]:
3 * a

12

In [56]:
total = a + b

In [57]:
total

13

In [58]:
a = 10

In [59]:
total

13

In [60]:
total = a + b

In [61]:
total

19

In [21]:
word = 'total'

In [22]:
total

19

### Why Names? ###

Names that describe what the variable is are helpful.  At some point in the future, you might come back to look at something that you wrote and if you have names like **a** and **b** instead of **hours_per_week** and **hours_per_year** it will take you longer to understand the code because you'll also be struggling to remember what **a** and **b** stand for.

In [24]:
hours_per_week = 40
weeks_per_year = 52

In [25]:
hours_per_year = hours_per_week * weeks_per_year

In [26]:
hours_per_year

2080

In [27]:
# Minimum wage for businesses w/26 or more employees
# Goes up by $1/hr until 2022
ca_hourly_minimum_wage = 15.00

In [28]:
weekly_wages = hours_per_week * ca_hourly_minimum_wage
weekly_wages

600.0

In [29]:
yearly_wages = hours_per_year * ca_hourly_minimum_wage
yearly_wages

31200.0

In [44]:
40 * 15.00

600.0

In [45]:
40 * 52 * 15.00

31200.0

## Functions and Call Expressions

In [30]:
max(15, 27*2, 50)

54

In [47]:
abs(-5)

5

In [48]:
abs(1 - 3)

2

In [31]:
day_temp = 52
night_temp = 47
abs(night_temp - day_temp)

5

In [32]:
min(14, 15)

14

In [62]:
round(123.456)

123

In [54]:
help(round)

Help on built-in function round in module builtins:

round(number, ndigits=None)
    Round a number to a given precision in decimal digits.

    The return value is an integer if ndigits is omitted or None.  Otherwise
    the return value has the same type as the number.  ndigits may be negative.

In [63]:
round(123345678.456, 2)

123345678.46

In [64]:
(3+10/11)

3.909090909090909

In [65]:
1/3

0.3333333333333333

In [68]:
round(123.456, ndigits=1)

123.5

## Tables ##

In [72]:
cones = Table.read_table('cones.csv')
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [70]:
cones.show(3)

In [73]:
cones.show()

In [74]:
cones.select('Flavor')

Flavor
strawberry
chocolate
chocolate
strawberry
chocolate
bubblegum

In [80]:
cones.select('Price', 'Flavor')

Price | Flavor
3.55  | strawberry
4.75  | chocolate
5.25  | chocolate
5.25  | strawberry
5.25  | chocolate
4.75  | bubblegum

In [81]:
cones.select(Flavor, 'Price')

NameError: name 'Flavor' is not defined

In [82]:
cones.drop('Color')

Flavor     | Price
strawberry | 3.55
chocolate  | 4.75
chocolate  | 5.25
strawberry | 5.25
chocolate  | 5.25
bubblegum  | 4.75

In [83]:
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [84]:
cones_without_price = cones.drop('Price')
cones_without_price

Flavor     | Color
strawberry | pink
chocolate  | light brown
chocolate  | dark brown
strawberry | pink
chocolate  | dark brown
bubblegum  | pink

In [85]:
cones.where('Flavor', 'chocolate')

#.where("Color", "light brown")#.select("Price")

Flavor    | Color       | Price
chocolate | light brown | 4.75
chocolate | dark brown  | 5.25
chocolate | dark brown  | 5.25

In [86]:
cones.sort('Price')

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25

In [87]:
cones.sort('Price', descending = True)

Flavor     | Color       | Price
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
chocolate  | light brown | 4.75
bubblegum  | pink        | 4.75
strawberry | pink        | 3.55

In [88]:
help(Table.sort)

Help on function sort in module datascience.tables:

sort(self, column_or_label, descending=False, distinct=False)
    Return a Table of rows sorted according to the values in a column.

    Args:
        ``column_or_label``: the column whose values are used for sorting.

        ``descending``: if True, sorting will be in descending, rather than
            ascending order.

        ``distinct``: if True, repeated values in ``column_or_label`` will
            be omitted.

    Returns:
        An instance of ``Table`` containing rows sorted based on the values
        in ``column_or_label``.

    >>> marbles = Table().with_columns(
    ...    "Color", make_array("Red", "Green", "Blue", "Red", "Green", "Green"),
    ...    "Shape", make_array("Round", "Rectangular", "Rectangular", "Round", "Rectangular", "Round"),
    ...    "Amount", make_array(4, 6, 12, 7, 9, 2),
    ...    "Price", make_array(1.30, 1.30, 2.00, 1.75, 1.40, 1.00))
    >>> marbles
    Color | Shape       | Amount | Price
    Red   | Round       | 4      | 1.3
    Green | Rectangular | 6      | 1.3
    Blue  | Rectangular | 12     | 2
    Red   | Round       | 7      | 1.75
    Green | Rectangular | 9      | 1.4
    Green | Round       | 2      | 1
    >>> marbles.sort("Amount")
    Color | Shape       | Amount | Price
    Green | Round       | 2      | 1
    Red   | Round       | 4      | 1.3
    Green | Rectangular | 6      | 1.3
    Red   | Round       | 7      | 1.75
    Green | Rectangular | 9      | 1.4
    Blue  | Rectangular | 12     | 2
    >>> marbles.sort("Amount", descending = True)
    Color | Shape       | Amount | Price
    Blue  | Rectangular | 12     | 2
    Green | Rectangular | 9      | 1.4
    Red   | Round       | 7      | 1.75
    Green | Rectangular | 6      | 1.3
    Red   | Round       | 4      | 1.3
    Green | Round       | 2      | 1
    >>> marbles.sort(3) # the Price column
    Color | Shape       | Amount | Price
    Green | Round       | 2      | 1
    Red   | Round       | 4      | 1.3
    Green | Rectangular | 6      | 1.3
    Green | Rectangular | 9      | 1.4
    Red   | Round       | 7      | 1.75
    Blue  | Rectangular | 12     | 2
    >>> marbles.sort(3, distinct = True)
    Color | Shape       | Amount | Price
    Green | Round       | 2      | 1
    Red   | Round       | 4      | 1.3
    Green | Rectangular | 9      | 1.4
    Red   | Round       | 7      | 1.75
    Blue  | Rectangular | 12     | 2

In [89]:
cones.sort("Flavor")

Flavor     | Color       | Price
bubblegum  | pink        | 4.75
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
chocolate  | dark brown  | 5.25
strawberry | pink        | 3.55
strawberry | pink        | 5.25

In [90]:
cones.sort('Flavor', descending=True)

Flavor     | Color       | Price
strawberry | pink        | 3.55
strawberry | pink        | 5.25
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

### A more interesting table

In [37]:
skyscrapers = Table.read_table('skyscrapers.csv')
skyscrapers

name                              | material  | city          | height | completed
One World Trade Center            | composite | New York City | 541.3  | 2014
Willis Tower                      | steel     | Chicago       | 442.14 | 1974
432 Park Avenue                   | concrete  | New York City | 425.5  | 2015
Trump International Hotel & Tower | concrete  | Chicago       | 423.22 | 2009
Empire State Building             | steel     | New York City | 381    | 1931
Bank of America Tower             | composite | New York City | 365.8  | 2009
Stratosphere Tower                | concrete  | Las Vegas     | 350.22 | 1996
Aon Center                        | steel     | Chicago       | 346.26 | 1973
John Hancock Center               | steel     | Chicago       | 343.69 | 1969
WITI TV Tower                     | steel     | Shorewood     | 329    | 1962
... (190 rows omitted)

In [38]:
skyscrapers.sort("height", descending=True).show(5)

In [67]:
skyscrapers.where('city', 'Los Angeles')

name                  | material | city        | height | completed
U.S. Bank Tower       | steel    | Los Angeles | 310.29 | 1990
Aon Center            | steel    | Los Angeles | 261.52 | 1974
Two California Plaza  | steel    | Los Angeles | 228.6  | 1992
Gas Company Tower     | steel    | Los Angeles | 228.3  | 1991
Bank of America Plaza | steel    | Los Angeles | 224.03 | 1975
777 Tower             | steel    | Los Angeles | 221    | 1991
Wells Fargo Tower     | steel    | Los Angeles | 220.37 | 1983
Figueroa at Wilshire  | steel    | Los Angeles | 218.54 | 1989
City National Tower   | steel    | Los Angeles | 213.06 | 1971
Paul Hastings Tower   | steel    | Los Angeles | 213.06 | 1971
... (1 rows omitted)

In [96]:
skyscrapers.where('city', 'Los Angeles').drop('city')

name                  | material | height | completed
U.S. Bank Tower       | steel    | 310.29 | 1990
Aon Center            | steel    | 261.52 | 1974
Two California Plaza  | steel    | 228.6  | 1992
Gas Company Tower     | steel    | 228.3  | 1991
Bank of America Plaza | steel    | 224.03 | 1975
777 Tower             | steel    | 221    | 1991
Wells Fargo Tower     | steel    | 220.37 | 1983
Figueroa at Wilshire  | steel    | 218.54 | 1989
City National Tower   | steel    | 213.06 | 1971
Paul Hastings Tower   | steel    | 213.06 | 1971
... (1 rows omitted)

In [41]:
skyscrapers.where('name', 'Empire State Building')

name                  | material | city          | height | completed
Empire State Building | steel    | New York City | 381    | 1931

In [97]:
skyscrapers.where('city', 'New York City').sort('completed').show(3)

In [98]:
skyscrapers.where('city', 'New York City').sort('completed', descending=True)

name                                             | material       | city          | height | completed
432 Park Avenue                                  | concrete       | New York City | 425.5  | 2015
Sky                                              | concrete       | New York City | 206    | 2015
One World Trade Center                           | composite      | New York City | 541.3  | 2014
One57                                            | steel/concrete | New York City | 306.07 | 2014
4 World Trade Center                             | composite      | New York City | 297.73 | 2014
Courtyard & Residence Inn Manhattan/Central Park | concrete       | New York City | 229.62 | 2013
Eight Spruce Street                              | concrete       | New York City | 265.18 | 2011
1 MiMA Tower                                     | concrete       | New York City | 194.55 | 2011
Goldman Sachs Headquarters                       | steel          | New York City | 228.3  | 2010
Langham Place                                    | concrete       | New York City | 192.58 | 2010
... (63 rows omitted)

In [104]:
skyscrapers.where('city', are.contained_in('New York City Los Angeles')).show()

In [69]:
skyscrapers.where('completed', are.between(1970,1980)).sort('completed').show()

In [ ]:
skyscrapers.where('height', are.not_equal_to(300)).sort('height').show()

In [42]:
skyscrapers.where('height', are.above(300)).sort('height').show()

In [71]:
skyscrapers.where('city', are.contained_in('New York Los Angeles')).show()